/* automatically generated by rust-bindgen 0.60.1 */

pub const OQS_KEM_alg_bike_l1: &[u8; 8usize] = b"BIKE-L1\0";
pub const OQS_KEM_alg_bike_l3: &[u8; 8usize] = b"BIKE-L3\0";
pub const OQS_KEM_alg_classic_mceliece_348864: &[u8; 24usize] = b"Classic-McEliece-348864\0";
pub const OQS_KEM_alg_classic_mceliece_348864f: &[u8; 25usize] = b"Classic-McEliece-348864f\0";
pub const OQS_KEM_alg_classic_mceliece_460896: &[u8; 24usize] = b"Classic-McEliece-460896\0";
pub const OQS_KEM_alg_classic_mceliece_460896f: &[u8; 25usize] = b"Classic-McEliece-460896f\0";
pub const OQS_KEM_alg_classic_mceliece_6688128: &[u8; 25usize] = b"Classic-McEliece-6688128\0";
pub const OQS_KEM_alg_classic_mceliece_6688128f: &[u8; 26usize] = b"Classic-McEliece-6688128f\0";
pub const OQS_KEM_alg_classic_mceliece_6960119: &[u8; 25usize] = b"Classic-McEliece-6960119\0";
pub const OQS_KEM_alg_classic_mceliece_6960119f: &[u8; 26usize] = b"Classic-McEliece-6960119f\0";
pub const OQS_KEM_alg_classic_mceliece_8192128: &[u8; 25usize] = b"Classic-McEliece-8192128\0";
pub const OQS_KEM_alg_classic_mceliece_8192128f: &[u8; 26usize] = b"Classic-McEliece-8192128f\0";
pub const OQS_KEM_alg_hqc_128: &[u8; 8usize] = b"HQC-128\0";
pub const OQS_KEM_alg_hqc_192: &[u8; 8usize] = b"HQC-192\0";
pub const OQS_KEM_alg_hqc_256: &[u8; 8usize] = b"HQC-256\0";
pub const OQS_KEM_alg_kyber_512: &[u8; 9usize] = b"Kyber512\0";
pub const OQS_KEM_alg_kyber_768: &[u8; 9usize] = b"Kyber768\0";

pub const OQS_KEM_saber_firesaber_length_ciphertext: u32 = 1472;
pub const OQS_KEM_saber_firesaber_length_shared_secret: u32 = 32;
pub const OQS_KEM_frodokem_640_aes_length_public_key: u32 = 9616;
pub const OQS_KEM_frodokem_640_aes_length_secret_key: u32 = 19888;
pub const OQS_KEM_frodokem_640_aes_length_ciphertext: u32 = 9720;
pub const OQS_KEM_frodokem_640_aes_length_shared_secret: u32 = 16;
pub const OQS_KEM_frodokem_640_shake_length_public_key: u32 = 9616;
pub const OQS_KEM_frodokem_640_shake_length_secret_key: u32 = 19888;
pub const OQS_KEM_frodokem_640_shake_length_ciphertext: u32 = 9720;
pub const OQS_KEM_frodokem_640_shake_length_shared_secret: u32 = 16;
pub const OQS_KEM_frodokem_976_aes_length_public_key: u32 = 15632;
pub const OQS_KEM_frodokem_976_aes_length_secret_key: u32 = 31296;
pub const OQS_KEM_frodokem_976_aes_length_ciphertext: u32 = 15744;
pub const OQS_KEM_frodokem_976_aes_length_shared_secret: u32 = 24;
pub const OQS_KEM_frodokem_976_shake_length_public_key: u32 = 15632;
pub const OQS_KEM_frodokem_976_shake_length_secret_key: u32 = 31296;
pub const OQS_KEM_frodokem_976_shake_length_ciphertext: u32 = 15744;
pub const OQS_KEM_frodokem_976_shake_length_shared_secret: u32 = 24;
pub const OQS_KEM_frodokem_1344_aes_length_public_key: u32 = 21520;
pub const OQS_KEM_frodokem_1344_aes_length_secret_key: u32 = 43088;
pub const OQS_KEM_frodokem_1344_aes_length_ciphertext: u32 = 21632;
pub const OQS_KEM_frodokem_1344_aes_length_shared_secret: u32 = 32;
pub const OQS_KEM_frodokem_1344_shake_length_public_key: u32 = 21520;
pub const OQS_KEM_frodokem_1344_shake_length_secret_key: u32 = 43088;
pub const OQS_KEM_frodokem_1344_shake_length_ciphertext: u32 = 21632;
pub const OQS_KEM_frodokem_1344_shake_length_shared_secret: u32 = 32;
extern "C" {
    pub fn OQS_KEM_alg_identifier(i: usize) -> *const ::libc::c_char;
}
extern "C" {
    pub fn OQS_KEM_alg_count() -> ::libc::c_int;
}
extern "C" {
    pub fn OQS_KEM_alg_is_enabled(method_name: *const ::libc::c_char) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OQS_KEM {
    pub method_name: *const ::libc::c_char,
    pub alg_version: *const ::libc::c_char,
    pub claimed_nist_level: u8,
    pub ind_cca: bool,
    pub length_public_key: usize,
    pub length_secret_key: usize,
    pub length_ciphertext: usize,
    pub length_shared_secret: usize,
    pub keypair: ::core::option::Option<
        unsafe extern "C" fn(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS,
    >,
    pub encaps: ::core::option::Option<
        unsafe extern "C" fn(
            ciphertext: *mut u8,
            shared_secret: *mut u8,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub decaps: ::core::option::Option<
        unsafe extern "C" fn(
            shared_secret: *mut u8,
            ciphertext: *const u8,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
}
#[test]
fn bindgen_test_layout_OQS_KEM() {
    assert_eq!(
        ::core::mem::size_of::<OQS_KEM>(),
        80usize,
        concat!("Size of: ", stringify!(OQS_KEM))
    );
    assert_eq!(
        ::core::mem::align_of::<OQS_KEM>(),
        8usize,
        concat!("Alignment of ", stringify!(OQS_KEM))
    );
    fn test_field_method_name() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).method_name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(method_name)
            )
        );
    }
    test_field_method_name();
    fn test_field_alg_version() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).alg_version) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(alg_version)
            )
        );
    }
    test_field_alg_version();
    fn test_field_claimed_nist_level() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).claimed_nist_level) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(claimed_nist_level)
            )
        );
    }
    test_field_claimed_nist_level();
    fn test_field_ind_cca() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).ind_cca) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(ind_cca)
            )
        );
    }
    test_field_ind_cca();
    fn test_field_length_public_key() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_public_key) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(length_public_key)
            )
        );
    }
    test_field_length_public_key();
    fn test_field_length_secret_key() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_secret_key) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(length_secret_key)
            )
        );
    }
    test_field_length_secret_key();
    fn test_field_length_ciphertext() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_ciphertext) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(length_ciphertext)
            )
        );
    }
    test_field_length_ciphertext();
    fn test_field_length_shared_secret() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_shared_secret) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(length_shared_secret)
            )
        );
    }
    test_field_length_shared_secret();
    fn test_field_keypair() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).keypair) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(keypair)
            )
        );
    }
    test_field_keypair();
    fn test_field_encaps() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).encaps) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(encaps)
            )
        );
    }
    test_field_encaps();
    fn test_field_decaps() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_KEM>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).decaps) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_KEM),
                "::",
                stringify!(decaps)
            )
        );
    }
    test_field_decaps();
}
extern "C" {
    pub fn OQS_KEM_new(method_name: *const ::libc::c_char) -> *mut OQS_KEM;
}
extern "C" {
    pub fn OQS_KEM_keypair(
        kem: *const OQS_KEM,
        public_key: *mut u8,
        secret_key: *mut u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_KEM_encaps(
        kem: *const OQS_KEM,
        ciphertext: *mut u8,
        shared_secret: *mut u8,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_KEM_decaps(
        kem: *const OQS_KEM,
        shared_secret: *mut u8,
        ciphertext: *const u8,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_KEM_free(kem: *mut OQS_KEM);
}
extern "C" {
    pub fn OQS_KEM_bike_l1_new() -> *mut OQS_KEM;
}
extern "C" {
