/* automatically generated by rust-bindgen 0.60.1 */

pub const OQS_SIG_alg_picnic_L1_FS: &[u8; 13usize] = b"picnic_L1_FS\0";
pub const OQS_SIG_alg_picnic_L1_UR: &[u8; 13usize] = b"picnic_L1_UR\0";
pub const OQS_SIG_alg_picnic_L1_full: &[u8; 15usize] = b"picnic_L1_full\0";
pub const OQS_SIG_alg_picnic_L3_FS: &[u8; 13usize] = b"picnic_L3_FS\0";
pub const OQS_SIG_alg_picnic_L3_UR: &[u8; 13usize] = b"picnic_L3_UR\0";
pub const OQS_SIG_alg_picnic_L3_full: &[u8; 15usize] = b"picnic_L3_full\0";
pub const OQS_SIG_alg_picnic_L5_FS: &[u8; 13usize] = b"picnic_L5_FS\0";
pub const OQS_SIG_alg_picnic_L5_UR: &[u8; 13usize] = b"picnic_L5_UR\0";
pub const OQS_SIG_alg_picnic_L5_full: &[u8; 15usize] = b"picnic_L5_full\0";
pub const OQS_SIG_alg_picnic3_L1: &[u8; 11usize] = b"picnic3_L1\0";
pub const OQS_SIG_alg_picnic3_L3: &[u8; 11usize] = b"picnic3_L3\0";
pub const OQS_SIG_alg_picnic3_L5: &[u8; 11usize] = b"picnic3_L5\0";
pub const OQS_SIG_alg_dilithium_2: &[u8; 11usize] = b"Dilithium2\0";
pub const OQS_SIG_alg_dilithium_3: &[u8; 11usize] = b"Dilithium3\0";
pub const OQS_SIG_alg_dilithium_5: &[u8; 11usize] = b"Dilithium5\0";
pub const OQS_SIG_alg_dilithium_2_aes: &[u8; 15usize] = b"Dilithium2-AES\0";
pub const OQS_SIG_alg_dilithium_3_aes: &[u8; 15usize] = b"Dilithium3-AES\0";
pub const OQS_SIG_alg_dilithium_5_aes: &[u8; 15usize] = b"Dilithium5-AES\0";
pub const OQS_SIG_alg_falcon_512: &[u8; 11usize] = b"Falcon-512\0";
pub const OQS_SIG_alg_falcon_1024: &[u8; 12usize] = b"Falcon-1024\0";

pub const OQS_SIG_sphincs_shake256_192f_robust_length_signature: u32 = 35664;
pub const OQS_SIG_sphincs_shake256_192f_simple_length_public_key: u32 = 48;
pub const OQS_SIG_sphincs_shake256_192f_simple_length_secret_key: u32 = 96;
pub const OQS_SIG_sphincs_shake256_192f_simple_length_signature: u32 = 35664;
pub const OQS_SIG_sphincs_shake256_192s_robust_length_public_key: u32 = 48;
pub const OQS_SIG_sphincs_shake256_192s_robust_length_secret_key: u32 = 96;
pub const OQS_SIG_sphincs_shake256_192s_robust_length_signature: u32 = 16224;
pub const OQS_SIG_sphincs_shake256_192s_simple_length_public_key: u32 = 48;
pub const OQS_SIG_sphincs_shake256_192s_simple_length_secret_key: u32 = 96;
pub const OQS_SIG_sphincs_shake256_192s_simple_length_signature: u32 = 16224;
pub const OQS_SIG_sphincs_shake256_256f_robust_length_public_key: u32 = 64;
pub const OQS_SIG_sphincs_shake256_256f_robust_length_secret_key: u32 = 128;
pub const OQS_SIG_sphincs_shake256_256f_robust_length_signature: u32 = 49856;
pub const OQS_SIG_sphincs_shake256_256f_simple_length_public_key: u32 = 64;
pub const OQS_SIG_sphincs_shake256_256f_simple_length_secret_key: u32 = 128;
pub const OQS_SIG_sphincs_shake256_256f_simple_length_signature: u32 = 49856;
pub const OQS_SIG_sphincs_shake256_256s_robust_length_public_key: u32 = 64;
pub const OQS_SIG_sphincs_shake256_256s_robust_length_secret_key: u32 = 128;
pub const OQS_SIG_sphincs_shake256_256s_robust_length_signature: u32 = 29792;
pub const OQS_SIG_sphincs_shake256_256s_simple_length_public_key: u32 = 64;
pub const OQS_SIG_sphincs_shake256_256s_simple_length_secret_key: u32 = 128;
pub const OQS_SIG_sphincs_shake256_256s_simple_length_signature: u32 = 29792;
extern "C" {
    pub fn OQS_SIG_alg_identifier(i: usize) -> *const ::libc::c_char;
}
extern "C" {
    pub fn OQS_SIG_alg_count() -> ::libc::c_int;
}
extern "C" {
    pub fn OQS_SIG_alg_is_enabled(method_name: *const ::libc::c_char) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OQS_SIG {
    pub method_name: *const ::libc::c_char,
    pub alg_version: *const ::libc::c_char,
    pub claimed_nist_level: u8,
    pub euf_cma: bool,
    pub length_public_key: usize,
    pub length_secret_key: usize,
    pub length_signature: usize,
    pub keypair: ::core::option::Option<
        unsafe extern "C" fn(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS,
    >,
    pub sign: ::core::option::Option<
        unsafe extern "C" fn(
            signature: *mut u8,
            signature_len: *mut usize,
            message: *const u8,
            message_len: usize,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub verify: ::core::option::Option<
        unsafe extern "C" fn(
            message: *const u8,
            message_len: usize,
            signature: *const u8,
            signature_len: usize,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
}
#[test]
fn bindgen_test_layout_OQS_SIG() {
    assert_eq!(
        ::core::mem::size_of::<OQS_SIG>(),
        72usize,
        concat!("Size of: ", stringify!(OQS_SIG))
    );
    assert_eq!(
        ::core::mem::align_of::<OQS_SIG>(),
        8usize,
        concat!("Alignment of ", stringify!(OQS_SIG))
    );
    fn test_field_method_name() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).method_name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(method_name)
            )
        );
    }
    test_field_method_name();
    fn test_field_alg_version() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).alg_version) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(alg_version)
            )
        );
    }
    test_field_alg_version();
    fn test_field_claimed_nist_level() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).claimed_nist_level) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(claimed_nist_level)
            )
        );
    }
    test_field_claimed_nist_level();
    fn test_field_euf_cma() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).euf_cma) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(euf_cma)
            )
        );
    }
    test_field_euf_cma();
    fn test_field_length_public_key() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_public_key) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(length_public_key)
            )
        );
    }
    test_field_length_public_key();
    fn test_field_length_secret_key() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_secret_key) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(length_secret_key)
            )
        );
    }
    test_field_length_secret_key();
    fn test_field_length_signature() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).length_signature) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(length_signature)
            )
        );
    }
    test_field_length_signature();
    fn test_field_keypair() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).keypair) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(keypair)
            )
        );
    }
    test_field_keypair();
    fn test_field_sign() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).sign) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(sign)
            )
        );
    }
    test_field_sign();
    fn test_field_verify() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<OQS_SIG>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).verify) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(OQS_SIG),
                "::",
                stringify!(verify)
            )
        );
    }
    test_field_verify();
}
extern "C" {
    pub fn OQS_SIG_new(method_name: *const ::libc::c_char) -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_keypair(
        sig: *const OQS_SIG,
        public_key: *mut u8,
        secret_key: *mut u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_sign(
        sig: *const OQS_SIG,
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_verify(
        sig: *const OQS_SIG,
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        signature_len: usize,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_free(sig: *mut OQS_SIG);
}
extern "C" {
